# print, type, range, len, input, int, float, str... это стандартные (встроенные) функции

# печать
print('hello, functions')

# функция может быть без параметров, но возвращает результат
name = input()

# тип переменной - функция с параметрами и возвращаемым значением
t = type(123)

# диапазон - функция с параметром в возвращаемым значением
r = range(10)

# длина последовательности
len([1, 2, 3, 4])

# преобразование типов
int('10')
str(10)

# ... полезные функции

# модуль числа
abs(10)

# минимальное и максимальное значение
min(2, 3), max(4, 5)

# округление числа
round(3.14, 2)

# сумма элементов последовательности
sum(3, 4, 5, 6, 7)

# нумерация последовательности
enumerate(name)
